<p>Framy - это инструмент для разработчиков, которые создают веб-приложения на языке PHP. Основная цель Framy - предоставить разработчикам набор средств для быстрой и гибкой разработки приложений, избавить от необходимости рутинной и монотонной организации окружения и работы веб-приложения: обработки сессий, авторизации и аутентификации пользователей, работы с данными, валидации форм... Вы концентрируетесь лишь на реализации бизнес-логики приложения.</p>

<p>Основные особенности Framy:</p>
<ul>
    <li>Код изначально написан под PHP5</li>
    <li>Smarty в качестве шаблонизатора, с рядом реализованных хелперов</li>
    <li>Встроенный ORM</li>
    <li>Генерация кода</li>
    <li>MVC-архитектура</li>
</ul>