<p>
	<img src="./images/logo_big.png" style="float: left; height: 85px; margin-right: 10px"/>
	MZZ.Framework - это инструмент для людей, которые создают веб-приложения на PHP. 
	Основная цель MZZ - предоставить разработчикам набор средств для быстрой и гибкой разработки. 
	MZZ избавляет вас от необходимости рутинной и монотонной организации окружения и работы веб-приложения: 
	обработки сессий, авторизации и аутентификации пользователей, работы с данными, валидации форм... 
	Вы концентрируетесь лишь на реализации бизнес-логики приложения.
</p>

<div class="clear"></div>

<p>Краткий список особенностей MZZ:</p>
<ul>
    <li>Код изначально написан под PHP5</li>
    <li>Smarty в качестве шаблонизатора, с рядом реализованных хелперов</li>
    <li>Встроенный ORM</li>
    <li>Генерация кода</li>
    <li>MVC-архитектура</li>
    <li>Генерация дружественных урлов (ЧПУ)</li>
    <li>Удобная расширяемость</li>
    <li>Встроенная система авторизации, основанная на политике ролей</li>
    <li>Локализация и интернационализация приложения</li>
    <li>Кеширование</li>
    <li>И многое другое...</li>
</ul>