<p>Код mzz требуется оформлять в соответствии с этим стандартом, разработчикам проектов на mzz рекомендуется применять их тоже. Стандарты написаны на основе собственного опыта и нескольких других стандартов.</p>

<p>Все PHP-файлы должны быть сохранены в кодировке UTF-8 с расширением ".php" <strong>без</strong> <a href="http://en.wikipedia.org/wiki/Byte-order_mark">BOM-метки</a>.</p>
<p>Если PHP теги являются началом и/или концом файла, то не делайте переноса строк и пробелов перед ними и после.</p>

<p>Используйте для отступов 4 пробела. Символ табуляции не допускается.</p>

<p>Строки рекомендуется заканчивать символом перевода на новую строку с возвратом каретки (CRLF). Не используйте перенос в стиле Unix (LF).</p>