<p>Так как mzz использует объектно-ориентированный стиль программирования, то в коде должно быть минимальное число функций, поэтому желательно описать функцию как метод.</p>

<p>Функции и методы должны использовать "венгерскую нотацию" (т.е. "верблюжачью").</p>

<p>Для имени функций или методов можно использовать латинские буквы. Имя функции, в отличие от имени метода, может содержать также знаки подчеркивания ("_"). Старайтесь выбрать наиболее подходящее название, раскрывающее суть функции.</p>

<p>Функции должны иметь префикс в виде имени пакета для того, чтобы избежать проблем с функциями из других пакетов. Первая буква в имени должна быть в нижнем регистре, каждая первая буква "слова" - в верхнем.</p>

<p>Примеры имен функций (аналогично для методов):</p>
<<code>>
function setTitle()<br />
{<br />
...<br />
}<br />
<br />
function resolve()<br />
{<br />
...<br />
}
<</code>>
