<p> од mzz требуетс€ оформл€ть в соответствии с этим стандартом, разработчикам проектов на mzz рекомендуетс€ примен€ть их тоже. —тандарты написаны на основе собственного опыта и нескольких других стандартов.</p>

<p>¬се PHP-документы должны быть сохранены как ASCII текст в кодировке windows-1251 (cp1251). –асширение желательно использовать ".php". Ќе используйте расширение ".inc", так как веб-сервер может быть не настроен и такие файлы могут быть переданы в raw-виде клиенту (т.е. передано его содержимое).</p>
<p>≈сли PHP теги €вл€ютс€ началом и/или концом файла, то старайтесь не делать переноса строк и пробелов перед ними и после.</p>

<p>»спользуйте дл€ отступов 4 пробела. —имвол табул€ции не допускаетс€.</p>

<p>—троки рекомендуетс€ заканчивать символом перевода на новую строку с возвратом каретки (CRLF). Ќе используйте перенос в стиле Unix (LF).</p>