<p>
<i>Секция (section)</i><blockquote>Раздел сайта, служит своеобразным неймспейсом, позволяющий одному модулю оперировать разными наборами однотипных данных. Например: с помощью секций вы можете создать на сайте два форума, или 2 раздела для страниц (допустим, одни будут для отображения обычных страниц, а другой, служебный раздел, будет содержать информацию из служебных блоков на сайте).
</blockquote>

<i>Активный шаблон</i> <blockquote>Шаблон, располагающийся в каталоге "templates/act/section" (где section - имя раздела). Именно в этом шаблоне происходит определение основного конента страницы.</blockquote>

<i>Сущность (доменный объект)</i> <blockquote>Набор данных (свойств), которые принадлежат какому-то элементу. Это может быть новость, страница, комментарий или профиль пользователя.</blockquote>

<i>JIP-окно</i> <blockquote>Способ открытия страниц, который используется для административных действий. Открывается непосредственно на текущей странице и не требует перезагрузки окна браузера, т.к. используется AJAX.</blockquote>

<i>JIP-меню</i> <blockquote>Используется для административных действий. Кнопка открытия JIP-меню находится рядом с каждым доменном объектом на сайте, у которого есть действия, помеченные как JIP, и к которым текущий пользователь имеет доступ. Открываются все действия в JIP-окне.</blockquote>

</p>

