<p>
<i>Секция (section)</i><blockquote>Раздел сайта, служит своеобразным неймспейсом, позволяющий одному модулю оперировать разными наборами однотипных данных. Например: с помощью секций вы можете создать на сайте два форума, или 2 раздела для страниц (допустим, одни будут для отображения обычных страниц, а другой, служебный раздел, будет содержать информацию из служебных блоков на сайте).
</blockquote>

<i>Активный шаблон</i> <blockquote>Шаблон, располагающийся в каталоге "templates/act/section" (где section - имя раздела). Именно в этом шаблоне происходит запуск необходимых модулей.</blockquote>
<i>JIP-окно</i> <blockquote>HTML-элемент &lt;DIV&gt; с идентификатором jipN (где N - порядковое число). При открытии JIP-окна этот элемент становится видимым, блокируется основное содержимое сайта и в него загружается необходимая страница средствами Ajax.</blockquote>
<i>JIP-меню</i> <blockquote>HTML-элемент &lt;DIV&gt; с идентификатором jip_menu_ID (где ID - идентификатор объекта к которому он принадлежит любого вида). При нажатии на соответствующий значок рядом с объектом этот элемент становится видимым. В нем собраны ссылки в виде элементов меню на все доступные текущему пользователю действия, которые открываются в JIP-окне.</blockquote>
</p>

