<p>
<i>—екци€</i> - ("section") - раздел сайта, служит своеобразным неймспейсом, позвол€ющий одному модулю оперировать разными наборами однотипных данных. Ќапример: с помощью секций вы можете создать на сайте два форума, или 2 раздела дл€ страниц (допустим, одни будут дл€ отображени€ обычных страниц, а другой, служебный раздел, будет содержать информацию из служебных блоков на сайте).
</p>
<p>
<i>јктивный шаблон</i> - шаблон, располагающийс€ в каталоге "templates/act/section" (где section - им€ раздела). »менно в этом шаблоне происходит запуск необходимых модулей.
</p>