<p>Framy - это инструмент для людей, которые создают веб-приложения на PHP. Основная цель Framy - предоставить разработчикам набор средств для быстрой и гибкой разработки. Framy избавляет вас от необходимости рутинной и монотонной организации окружения и работы веб-приложения: обработки сессий, авторизации и аутентификации пользователей, работы с данными, валидации форм... Вы концентрируетесь лишь на реализации бизнес-логики приложения.</p>

<p>Краткий список особенностей Framy:</p>
<ul>
    <li>Код изначально написан под PHP5</li>
    <li>Smarty в качестве шаблонизатора, с рядом реализованных хелперов</li>
    <li>Встроенный ORM</li>
    <li>Генерация кода</li>
    <li>MVC-архитектура</li>
    <li>Генерация дружественных урлов (ЧПУ)</li>
    <li>Удобная расширяемость</li>
    <li>Встроенная система авторизации, основанная на политике ролей</li>
    <li>Локализация</li>
    <li>Кеширование</li>
    <li>И многое другое...</li>
</ul>