<p>Определимся с набором возможных действий модуля.</p>
<ul>
    <li><em>list</em> - экшн, который будет возвращать список комментариев для данного объекта;</li>
    <li><em>post</em> - экшн для добавления нового комментария;</li>
    <li><em>edit</em> - экшн для исправления уже существующего комментария;</li>
    <li><em>delete</em> - экшн для удаления комментария.</li>
</ul>
<p>В систему будут добавлены следующие сущности:</p>
<ul>
    <li><em>comment</em> - сущность, обозначающая непосредственно комментарий;</li>
    <li><em>commentsFolder</em> - сущность скорее носящая служебный характер. Причины введения этой сущности будут поясняться в процессе этой главы.</li>
</ul>