<p>Структура каталогов mzz выглядит следующим образом:</p>
<<code>>
        mzz<br />
        |<br />
        |------- <b>libs/</b><br />
        |<br />
        |------- <b>system/</b><br />
        |<br />
        |------- <b>tests/</b><br />
<</code>>
<p>Перечислим все представленные каталоги и опишем их назначение:
</p>
    <ul>
        <li><em>libs/</em> - каталог, в котором расположены сторонние библиотеки (PEAR, simpletest, smarty)
        </li>
        <li><em>system/</em> - основной каталог, в котором непосредственно размещается сам фреймворк
        </li>
        <li><em>tests/</em> - каталог, в котором расположены модульные тесты фреймворка
        </li>
    </ul>
</p>