<p>
	dummy-приложение - это макет нового "пустого" приложения, который можно использовать как основу для разработки
	новых приложений. В данном приложении не подключено ниодного модуля, кроме модуля-пустышки dummy.
</p>
<p>Исходные коды dummy-приложения могут быть получены из SVN-репозитория: </p>
<<code bash>>
svn checkout svn://svn.mzz.ru/mzz/apps/dummy/trunk
<</code>>
<p>
	Установка dummy-приложения практически аналогична <a href="./setup.setup_demo.html">установке demo-приложения</a>.
</p>